#include <iostream>

using namespace std;

// 풀이.
// 주어진대로 풀었는데 뭔가 이상해서 보니 영문으로 된 문제라 한글로 번역했는데
// 이때 주어진 예제가 뒤틀려있었다. 후...

int main()
{
    cout << "  ___  ___  ___" << '\n';
    cout << "  | |__| |__| |" << '\n';
    cout << "  |           |" << '\n';
    cout << "   \\_________/" << '\n';
    cout << "    \\_______/" << '\n';
    cout << "     |     |" << '\n';
    cout << "     |     |" << '\n';
    cout << "     |     |" << '\n';
    cout << "     |     |" << '\n';
    cout << "     |_____|" << '\n';
    cout << "  __/       \\__" << '\n';
    cout << " /             \\" << '\n';
    cout << "/_______________\\" << '\n';
    return 0;
}